app/controllers/places_controller.rb

	def show
		@place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 1 LIMIT 1

	def create
		Place.create(title: params["title"], photo: params["photo"], price: params["price"], description: params["description"])
---
INSERT INTO "places" ("description", "photo", "price", "title") VALUES (?, ?, ?, ?)  [["description", "This is a new attraction!"], ["photo", "http://photo.com"], ["price", 25], ["title", "New Attraction"]]

	def edit
		@place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 12 LIMIT 1

	def update
		place = Place.find_by(:id => params["id"])
		place.title = params["title"]
		place.photo = params["photo"]
		place.price = params["price"]
		place.description = params["description"]
		place.save
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1
UPDATE "places" SET "title" = ? WHERE "places"."id" = 12  [["title", "The Met Museum of Art"]]

	def delete
		place = Place.find_by(:id => params["id"])
		place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 11 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 11